
var dom = document.getElementById("pic3.2");
var myChart3_2 = echarts.init(dom);
var time = [
["1976","0.361 ","0.227 "],
["1977","0.347 ","0.286 "],
["1978","0.294 ","0.252 "],
["1979","0.159 ","0.242 "],
["1980","0.196 ","0.234 "],
["1981","0.175 ","0.210 "],
["1982","0.430 ","0.210 "],
["1983","0.405 ","0.217 "],
["1984","0.108 ","0.180 "],
["1985","0.196 ","0.182 "],
["1986","0.078 ","0.159 "],
["1987","0.063 ","0.185 "],
["1988","0.226 ","0.158 "],
["1989","0.188 ","0.184 "],
["1990","0.255 ","0.171 "],
["1991","0.053 ","0.166 "],
["1992","0.200 ","0.172 "],
["1993","0.650 ","0.170 "],
["1994","0.184 ","0.144 "],
["1995","0.025 ","0.139 "],
["1996","0.061 ","0.125 "],
["1997","0.085 ","0.119 "],
["1998","0.039 ","0.116 "],
["1999","0.091 ","0.114 "],
["2000","0.052 ","0.097 "],
["2001","0.024 ","0.101 "],
["2002","0.075 ","0.106 "],
["2003","0.032 ","0.101 "],
["2004","0.017 ","0.086 "],
["2005","0.007 ","0.090 "],
["2006","0.013 ","0.090 "],
["2007","0.006 ","0.086 "],
["2008","0.011 ","0.083 "],
["2009","0.005 ","0.077 "],
["2010","0.004 ","0.062 "],
["2011","0.008 ","0.060 "],
["2012","0.004 ","0.054 "],
["2013","0.010 ","0.065 "],
["2014","0.003 ","0.068 "],
["2015","0.006 ","0.064 "],
["2016","0.003 ","0.057 "],
["2017","0.002 ","0.049 "],

]
var app = {};
option = {
    //backgroundColor: '#f7f7f7',
        title: {
            //text: '每万架次航班事故率（1976-2016）',
            //subtext: '数据来源于asn与世界银行数据库',
           // x: 'left'
        },
        tooltip: {
            trigger: 'axis'
        },
        legend: {
            data:['中国大陆','世界'],
            x: 'right'
        },
        xAxis: {
            data: time.map(function (item) {
                return item[0];
            }),
        },
        yAxis: {
            splitLine: {
                show: false,
            },
            min:0
        },
        dataZoom: [{
            startValue: '2014-06-01'
        }, {
            type: 'inside'
        }],
        /*visualMap: {
            top: 10,
            right: 10,
            pieces: [
            {
                gt: 0,
                lte: 0.1,
                color: '#096'
            },{
                gt: 0.1,
                lte: 0.7,
                color: '#ff9933'
            }]
        },*/

        series: [
            {
            name: '中国大陆',
            type: 'line',
            color: '#226b80',
            smooth:0.3,
            lineStyle:{
                width:4//设置线条粗细
            },

            data: time.map(function (item) {
				return item[1]*100;
            }),
            markLine: {
                symbol:'none',//去掉箭头
                itemStyle: {

                    normal: {
                        
                        color:"ffffff",
                        // color: null
                        // 线宽，这里线宽是屏幕的像素大小
                        width: 1,
                        // 线的透明度
                        opacity: 0.2,
                    }
                },
                
                silent: true,
                data: [ {
                    yAxis: 10
                },  {
                    yAxis: 20
                },{
                    yAxis: 30
                }, {
                    yAxis: 40
                }, {
                    yAxis: 50
                },{
                    yAxis: 60
                }, {
                    yAxis:70
                }]
            },
            large:true
        },
        {
            name: '世界',
            type: 'line',
            color: '#40a798',
            smooth:0.3,
            lineStyle:{
                width:4//设置线条粗细
            },

            data: time.map(function (item) {
				return item[2]*100;
            }),
            large:true
        },
    
    ]
    };
    myChart3_2.setOption(option);